[Play_X2_XP_S_RDJ_ADVENT_Burger_Ad_B AkEvent]
SpokenText="ADVENT Burger, are you eating it or is it eating you?"

[Play_X2_XP_S_RDJ_ADVENT_Burger_Ad_C AkEvent]
SpokenText="ADVENT Burger, serving humanity...with a side of fries."

[Play_X2_XP_S_RDJ_ADVENT_Burger_Ad_D AkEvent]
SpokenText="ADVENT Burger, where the customer is always right...in between the bun."

[Play_X2_XP_S_RDJ_ADVENT_Burger_Musing_A AkEvent]
SpokenText="Well, it's been 15 years serving the Resistance. I've got no regrets.  And to think, ADVENT Burger let me go. I bet the Elders are still regretting that decision."

[Play_X2_XP_S_RDJ_ADVENT_Burger_Musing_B AkEvent]
SpokenText="And here's a classy number courtesy of our XCOM forces in the field.  [ADVENT death sounds] I never get tired of hearing that."

[Play_X2_XP_S_RDJ_Eliminated_ADVENT_Commander_A AkEvent]
SpokenText="If you're a fan of the Resistance, good news from the front lines today. As I've heard it, XCOM tracked down a high-ranking member of the ADVENT murder squad; gave them a dose of their own medicine. According to reports, ADVENT's field commander was executed unceremoniously by the skilled soldiers of XCOM."

[Play_X2_XP_S_RDJ_Eliminated_ADVENT_Commander_B AkEvent]
SpokenText="On the death to the invaders front, our courageous friends at XCOM successfully tracked and eliminated a high-ranking ADVENT field commander responsible for untold crimes against humanity. Although the aliens are still well ahead in overall kill count, XCOM is slowly making progress towards evening things up. You just watch out! You just, you just watch out aliens! You just, you just step off aliens!"

[Play_X2_XP_S_RDJ_Eliminated_ADVENT_Commander_C AkEvent]
SpokenText="The always talented and ever-deadly forces of XCOM once again infuriated the Elders today by making quick work of a high-ranking ADVENT field commander who made the mistake of crossing paths with our vigilant friends. According to eyewitness accounts, the ADVENT officer's last words were "GOrrrralaslk Blahhhhh" which means absolutely nothing to anyone."

[Play_X2_XP_S_RDJ_Facility_Destroyed_A AkEvent]
SpokenText="Greetings Citizens! It is I, your fearless ADVENT Speaker! Today we mourn the loss of countless innocent alien...ah, nah, screw it. Today XCOM and the Resistance leveled one of the aliens' facilities. That's right, burnt it to the ground. That's pretty great news, huh? Go XCOM."

[Play_X2_XP_S_RDJ_Facility_Destroyed_B AkEvent]
SpokenText="This just in:  In what will definitely be pissing off the Elders' this evening, word is spreading of XCOM's great success in wiping another degenerate alien facility off our beautiful planet. Sources credit XCOM's mysterious Commander for turning the tide against our evil overlords."

[Play_X2_XP_S_RDJ_Facility_Destroyed_C AkEvent]
SpokenText="Did you happen to catch that massive fireball lighting up the western sky this evening? If not, here's a recap: It was beautiful, and all thanks to the grit of XCOM, who insist on destroying everything the Elders have built on this world. I myself couldn't agree more with their philosophies if I tried."

[Play_X2_XP_S_RDJ_Generic_Ambient_A AkEvent]
SpokenText="So have you heard about these people running around out in the woods, calling themselves Reapers? Hell, maybe you've met one? If you have, then you've probably heard about their unique dietary regimen. And if you haven't heard...lemme give you a tip-don't ask where the meat came from."

[Play_X2_XP_S_RDJ_Generic_Ambient_B AkEvent]
SpokenText="Hey out there Resistance psychos! Do you crave the excitement of battle? Are you eager to get back at the aliens for all the horrible things they've done to our planet? Well, have I got news for you! All you have to do is visit your local city center, and shoot your nearest ADVENT peacekeeper in the face. Do your part today!"

[Play_X2_XP_S_RDJ_Generic_Ambient_C AkEvent]
SpokenText="Huh, now this looks interesting. I've got a special request here from one of our donors.  It reads: "An intriguing offer for your listeners. I will triple the standard price for every ADVENT burger they can deliver to this location in the remote territories." Names a bit scribbled, it's hard to read.  Tegan?  Tagan? Tilgan?  Tygan?  Guy's not winning any awards for penmanship, I'll tell you that."

[Play_X2_XP_S_RDJ_Generic_Ambient_D AkEvent]
SpokenText="You probably noticed, we don't have a lot of music here on the ol' Resistance radio, in fact we don't have any music per se. It's not that I wouldn't love to rock the airwaves with some classic human death metal, but ADVENT's pretty much got all the good stuff locked down these days. I suppose I could hum a few bars...uh, nah."

[Play_X2_XP_S_RDJ_Generic_Ambient_E AkEvent]
SpokenText="I got a buddy out there working closely with XCOM, let's call him...Middle Official Stanford. So my friend, Stanford, is out there in the wilds for 20 years, trying to scrape together this Resistance organization without much luck. XCOM is in shambles, his best buddy is captured, the aliens blew up their base, and Brad...I mean, Stanford, is depressed, right? ...oh...hold up...looks like this is to be continued..."

[Play_X2_XP_S_RDJ_Generic_Ambient_F AkEvent]
SpokenText="For those of you who were tuned in last time, unfortunately I got a call from my buddy Stanford and he wasn't all that happy about me talking about him on the radio here. So...so-so we're not gonna do that anymore, I guess...so no hard feelings alright, pal? I'll buy you a new sweater or something to make it up to ya. In the meantime, you just keep killing aliens, or at least talking about killing aliens."

[Play_X2_XP_S_RDJ_Generic_Ambient_G AkEvent]
SpokenText="Mortana Bortat! Kracsad! Mox! Do you dream of understanding the nonsense that's constantly being spewed in your face whenever you step outside in our lovely little world? Well good news! Expert translators among the Resistance are hard at work deciphering the bull [bleep] of the ADVENT language. Soon, you too will be able to confuse and intimidate your friends! Isn't it awesome?"

[Play_X2_XP_S_RDJ_Generic_Ambient_H AkEvent]
SpokenText="You know, I've spent a lot of time thinking about these gene therapy clinics lately. It's tempting, right? You can treat your body like garbage, then stop in for a quick tune-up and you're good to go. Of course, if you believe the rumors, you might also get yourself turned into an ADVENT burger."

[Play_X2_XP_S_RDJ_Mission_Failure_A AkEvent]
SpokenText="This is the voice of the Resistance, the voice of the truth, bringing you the unfortunate news of our forces' defeat at the hands of the invaders. We may have lost some people today, but we won't give up hope--the aliens know this world belongs to humanity."

[Play_X2_XP_S_RDJ_Mission_Failure_B AkEvent]
SpokenText="Reporting from the front, indications are numerous Resistance fighters lost their lives today while engaged with an overwhelming number of invasion forces. They sacrificed everything for our cause, keep them in your thoughts."

[Play_X2_XP_S_RDJ_Mission_Failure_C AkEvent]
SpokenText="News from the front lines, several courageous resistance fighters were killed today during an assault on invasion forces moving outside one of the city centers. Despite this setback, Resistance leaders insist there will be no stoppage in future operations against the aliens."

[Play_X2_XP_S_RDJ_Mission_Failure_D AkEvent]
SpokenText="This is the voice of the Resistance bringing you the unfortunate news of defeat today against the forces of the invasion. We honor the sacrifice of those who serve, but the fight must go on, and humanity must retake this world."

[Play_X2_XP_S_RDJ_Mission_Failure_E AkEvent]
SpokenText="Despite blatant exaggerations by ADVENT state media, I can independently confirm that forces of the Resistance did suffer a defeat today against aggressive alien incursions into the outlying territories. All who have served and died for the resistance will be remembered for their sacrifice. "

[Play_X2_XP_S_RDJ_Mission_Success_A AkEvent]
SpokenText="This is the voice of the Resistance, spreading the truth about what's really happening out there. Word from the front lines--XCOM has once again proven that despite what ADVENT would have you believe, humanity isn't going down without a fight."

[Play_X2_XP_S_RDJ_Mission_Success_B AkEvent]
SpokenText="The aliens will always tell you otherwise, but this is the true voice of the Resistance, bringing you the real news about the latest victory over the invaders. We're getting stronger every day, and XCOM is making that happen."

[Play_X2_XP_S_RDJ_Mission_Success_C AkEvent]
SpokenText="To all our brothers and sisters supporting the cause, you should know, that today your efforts have helped our brave soldiers on the frontline achieve another victory over the invaders."

[Play_X2_XP_S_RDJ_Mission_Success_D AkEvent]
SpokenText="ADVENT propaganda continues to spread the message of dissident attacks, but this is the voice of the resistance, telling you not to believe their lies. Our fighters are giving it everything they've got to take back what is rightfully ours."

[Play_X2_XP_S_RDJ_Mission_Success_E AkEvent]
SpokenText="This is the voice of the Resistance, reminding you that the aliens will never admit defeat, even after our brave fighters have driven the last of them from our world. So never give up hope, never surrender."

[Play_X2_XP_S_RDJ_XCOM_Failure_A AkEvent]
SpokenText="Word on the propaganda wire is that things didn't go so well for XCOM today, from what I'm hearing, ADVENT made our intrepid Commander look like something of a rube out there. Let's hope our friends get their?sh-?uh, stuff...together."

[Play_X2_XP_S_RDJ_XCOM_Failure_B AkEvent]
SpokenText="You might as well hear it from me first, 'cause it's gonna be all over the ADVENT airwaves once they get their newspeak put together. The Resistance had a little misstep today, and unfortunately the aliens came out on top. I don't know the exact casualty numbers, but pour one out for our fallen brothers and sisters in humanity."

[Play_X2_XP_S_RDJ_XCOM_Failure_C AkEvent]
SpokenText="I never like being the bearer of bad news, at least not since I got this job, but unfortunately that's all I've got for you out there in Resistance land-bad news. The aliens and their various goons managed to take down XCOM in a straight fight, and it sounds like some good people were lost in the process."

[Play_X2_XP_S_RDJ_XCOM_Failure_D AkEvent]
SpokenText="Alright, settle down out there, this isn't funny. A lot of good people in the Resistance lost it today, and the aliens are going to make a HUGE deal about how they crushed the dissident threat...but don't let it get you down, we're closer than ever to kicking them the hell off our planet."

[Play_X2_XP_S_RDJ_XCOM_Failure_E AkEvent]
SpokenText="It's taken 20 years to get the ball rolling on this resistance, and we can't expect to win it all overnight. According to a scout I know, thing got ugly out there today for XCOM, and it sounds like they'll have to rethink the ol' approach. No worries though, we're all rootin' for ya."

[Play_X2_XP_S_RDJ_XCOM_Success_A AkEvent]
SpokenText="Wooohoo, boy! Did ADVENT get their asses kicked today or what?! Our ever-vigilant friends with the resistance took a big ol' bite out of our alien overlords, leaving an untold number of invaders slaughtered in their wake. It's always a good day for good news."

[Play_X2_XP_S_RDJ_XCOM_Success_B AkEvent]
SpokenText="I'm not sure who out there in Resistance land caught a clip of that fight today, but I don't think I've ever seen anything like that before. Our pals over at XCOM put a beat down on the aliens so bad those creepy green tubes they were born in are probably still shakin'! They keep this up, we might just win this thing."

[Play_X2_XP_S_RDJ_XCOM_Success_C AkEvent]
SpokenText="X-C-O-M, what's that spell?! XCOM! That's right! Another win for our guys and girls in black, making the Elders miserable one day at a time. If you happen to come across one of our brave friends, make sure you thank 'em for their service."

[Play_X2_XP_S_RDJ_XCOM_Success_D AkEvent]
SpokenText="You know, I don't get a whole lot of call-ins these days, but if I did, something tells me, if I were to poll our listeners, news of dead aliens would be high on their list of things that they love to hear. So, with that in mind, it is my pleasure to inform you that the human Resistance movement, led by the intrepid forces of XCOM, dealt another low-blow today to the alien scum of ADVENT."

[Play_X2_XP_S_RDJ_XCOM_Success_E AkEvent]
SpokenText="I probably shouldn't mention this on the air, but...woo, I've got a serious crush developing for that mysterious Commander running things over at XCOM. I'm not sure if we're talkin' about a man or a woman here, but still...have you seen what's been going on?! Just today, he or she kicked the hell out of some ADVENT goons like it was just another day at the park. Ooh, ooh, ooh!"

